#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>

```

terraform
module.linode.data.linode_profile.current: Reading...
module.linode.data.linode_profile.current: Read complete after 0s [id=3058147]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.linode.linode_firewall.instance_firewall will be created
  + resource "linode_firewall" "instance_firewall" {
      + devices         = (known after apply)
      + disabled        = false
      + id              = (known after apply)
      + inbound_policy  = "DROP"
      + label           = "Nextcloud"
      + linodes         = (known after apply)
      + outbound_policy = "DROP"
      + status          = (known after apply)

      + inbound {
          + action   = "ACCEPT"
          + ipv4     = [
              + "0.0.0.0/0",
            ]
          + ipv6     = []
          + label    = "allow-public-https-ingress-ipv4-only"
          + ports    = "443"
          + protocol = "TCP"
        }

      + outbound {
          + action   = "ACCEPT"
          + ipv4     = [
              + "0.0.0.0/0",
            ]
          + ipv6     = [
              + "::/0",
            ]
          + label    = "allow-https-egress"
          + ports    = "443"
          + protocol = "TCP"
        }
    }

  # module.linode.linode_instance.instance will be created
  + resource "linode_instance" "instance" {
      + backups            = (known after apply)
      + backups_enabled    = true
      + boot_config_label  = (known after apply)
      + booted             = (known after apply)
      + group              = "Productivity"
      + id                 = (known after apply)
      + ip_address         = (known after apply)
      + ipv4               = (known after apply)
      + ipv6               = (known after apply)
      + label              = "Nextcloud"
      + private_ip         = false
      + private_ip_address = (known after apply)
      + region             = "eu-west"
      + resize_disk        = false
      + shared_ipv4        = (known after apply)
      + specs              = (known after apply)
      + status             = (known after apply)
      + swap_size          = (known after apply)
      + type               = "g6-standard-1"
      + watchdog_enabled   = true

      + alerts {
          + cpu            = (known after apply)
          + io             = (known after apply)
          + network_in     = (known after apply)
          + network_out    = (known after apply)
          + transfer_quota = (known after apply)
        }

      + disk {
          + authorized_users = [
              + "batinica-ci",
            ]
          + filesystem       = (known after apply)
          + id               = (known after apply)
          + image            = "linode/ubuntu22.04"
          + label            = "boot"
          + read_only        = (known after apply)
          + size             = 51200
          + stackscript_data = (sensitive value)
          + stackscript_id   = (known after apply)
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @batinicaz, Action: `pull_request`, Working Directory: ``, Workflow: `Plan`*